In [2]:
# Import Dependencies
import matplotlib.pyplot as plt
import pandas as pd
import scipy.stats as st
import numpy as np

In [3]:
# Import Data
nyccensus_string = 'NYC_Census Data.csv'
nyccensus_df = pd.read_csv(nyccensus_string)
nyccensus_df.shape

(44, 16)

In [4]:
nyccensus_df.dtypes

Unnamed: 0                 object
Unnamed: 1                 object
Unnamed: 2                 object
Unnamed: 3                 object
New York city, New York    object
Unnamed: 5                 object
Unnamed: 6                 object
Unnamed: 7                 object
Unnamed: 8                 object
Unnamed: 9                 object
Unnamed: 10                object
Unnamed: 11                object
Unnamed: 12                object
Unnamed: 13                object
Unnamed: 14                object
Unnamed: 15                object
dtype: object

In [32]:
newrows = nyccensus_df[5:22]
newcolumns = newrows[["Unnamed: 0", "Unnamed: 8", "Unnamed: 12"]].copy()
newcolumns.columns = ['Age Range', 'Total Males', 'Total Females']

newcolumns

            Age Range Total Males Total Females
5        5 to 9 years     228,933       223,976
6      10 to 14 years     248,637       235,312
7      15 to 19 years     223,434       221,477
8      20 to 24 years     256,754       276,412
9      25 to 29 years     377,437       399,501
10     30 to 34 years     355,646       367,448
11     35 to 39 years     295,265       312,491
12     40 to 44 years     261,209       278,183
13     45 to 49 years     253,695       274,776
14     50 to 54 years     251,279       276,124
15     55 to 59 years     250,240       267,155
16     60 to 64 years     215,120       267,696
17     65 to 69 years     174,798       214,713
18     70 to 74 years     131,645       178,780
19     75 to 79 years      92,373       134,701
20     80 to 84 years      61,833        96,270
21  85 years and over      52,287       108,080